package chap03;

public class _01_Type {
    /*
    int : -2147483648~-2147483647 (대충 아래 위로 이십억 이상)
    long : -9223372036854775808 ~  -9223372036854775807
    byte : -128 ~ -127
    short : -32768 ~ 32767

    long형 변수가 int 최대 최소값을 넘어가면 끝에 L자 붙여줄 것! = 컴파일 오류 발생 가능성 있음

    float : -3.4*10^38 ~ 3.4*10^38
    double : -1.7*10^308 ~ 1.7*10^308

    - float 끝에는 꼭 F나 f붙여야 함
    - double d1 = 123.4;
    - double d2 = 1.234e2;
      (d1 == d2)

    int octal = 023; // 0으로 시작하면 8진수
    int hex = 0xC; //  0x로 시작하면 16진수

    문자열 비교 ==, equals()
    1) == 연산자 : 두 문자열의 주소값 같은지 비교
    2) equals() 메소드 : 두 문자열의 내용 비교

    ASCII
    A = 65 ~ / a = 97 ~ / 0 = 48 ~


     */

}
